In [1]:
import numpy as np
import pandas as pd

In [2]:
# Create a dataframe
data = {'Store':['Walmart','Walmart','Costco','Costco','Target','Target'],
       'Customer':['Tim','Jermy','Mark','Denice','Ray','Sam'],
       'Sales':[150,200,550,90,430,120]}
df = pd.DataFrame(data)
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

In [5]:
by_store = df.groupby('Store')

In [8]:
by_store.mean()

         Sales
Store
Costco     320
Target     275
Walmart    175

In [10]:
df.groupby('Store').sum().loc['Target']

Sales    550
Name: Target, dtype: int64

In [11]:
by_store.min() #get the minimum value

        Customer  Sales
Store
Costco    Denice     90
Target       Ray    120
Walmart    Jermy    150

In [12]:
by_store.max() #get the maximum value

        Customer  Sales
Store
Costco      Mark    550
Target       Sam    430
Walmart      Tim    200

In [14]:
by_store.count() #count the number of instances

         Customer  Sales
Store
Costco          2      2
Target          2      2
Walmart         2      2

In [16]:
by_store.describe() #describe the database

        Sales
        count   mean         std    min    25%    50%    75%    max
Store
Costco    2.0  320.0  325.269119   90.0  205.0  320.0  435.0  550.0
Target    2.0  275.0  219.203102  120.0  197.5  275.0  352.5  430.0
Walmart   2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0

In [18]:
by_store.describe().transpose()

Store            Costco      Target     Walmart
Sales count    2.000000    2.000000    2.000000
      mean   320.000000  275.000000  175.000000
      std    325.269119  219.203102   35.355339
      min     90.000000  120.000000  150.000000
      25%    205.000000  197.500000  162.500000
      50%    320.000000  275.000000  175.000000
      75%    435.000000  352.500000  187.500000
      max    550.000000  430.000000  200.000000

In [20]:
by_store.describe().transpose()['Walmart']

Sales  count      2.000000
       mean     175.000000
       std       35.355339
       min      150.000000
       25%      162.500000
       50%      175.000000
       75%      187.500000
       max      200.000000
Name: Walmart, dtype: float64